; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-24)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 room3)
(at ball4 room3)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
(at ball19 room5)
(at ball20 room6)
(at ball21 room6)
(at ball22 room6)
(at ball23 room6)
(at ball24 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
)
)
)

; plan
1. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 2 of 24
2. (pick ball24 room6 left)
   deleted: (at ball24 room6) (free left)
   added: (carry ball24 left)
   goals met: 2 of 24
3. (pick ball23 room6 right)
   deleted: (at ball23 room6) (free right)
   added: (carry ball23 right)
   goals met: 2 of 24
4. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 2 of 24
5. (drop ball23 rooma right)
   deleted: (carry ball23 right)
   added: (at ball23 rooma) (free right)
   goals met: 3 of 24
6. (drop ball24 rooma left)
   deleted: (carry ball24 left)
   added: (at ball24 rooma) (free left)
   goals met: 4 of 24
7. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 4 of 24
8. (pick ball22 room6 left)
   deleted: (at ball22 room6) (free left)
   added: (carry ball22 left)
   goals met: 4 of 24
9. (pick ball21 room6 right)
   deleted: (at ball21 room6) (free right)
   added: (carry ball21 right)
   goals met: 4 of 24
10. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 4 of 24
11. (drop ball21 rooma right)
   deleted: (carry ball21 right)
   added: (at ball21 rooma) (free right)
   goals met: 5 of 24
12. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 6 of 24
13. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 6 of 24
14. (pick ball20 room6 left)
   deleted: (at ball20 room6) (free left)
   added: (carry ball20 left)
   goals met: 6 of 24
15. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 6 of 24
16. (pick ball19 room5 right)
   deleted: (at ball19 room5) (free right)
   added: (carry ball19 right)
   goals met: 6 of 24
17. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 6 of 24
18. (drop ball19 rooma right)
   deleted: (carry ball19 right)
   added: (at ball19 rooma) (free right)
   goals met: 7 of 24
19. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 8 of 24
20. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 8 of 24
21. (pick ball18 room5 left)
   deleted: (at ball18 room5) (free left)
   added: (carry ball18 left)
   goals met: 8 of 24
22. (pick ball17 room5 right)
   deleted: (at ball17 room5) (free right)
   added: (carry ball17 right)
   goals met: 8 of 24
23. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 8 of 24
24. (drop ball17 rooma right)
   deleted: (carry ball17 right)
   added: (at ball17 rooma) (free right)
   goals met: 9 of 24
25. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 10 of 24
26. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 10 of 24
27. (pick ball16 room5 left)
   deleted: (at ball16 room5) (free left)
   added: (carry ball16 left)
   goals met: 10 of 24
28. (pick ball15 room5 right)
   deleted: (at ball15 room5) (free right)
   added: (carry ball15 right)
   goals met: 10 of 24
29. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 10 of 24
30. (drop ball15 rooma right)
   deleted: (carry ball15 right)
   added: (at ball15 rooma) (free right)
   goals met: 11 of 24
31. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 12 of 24
32. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 12 of 24
33. (pick ball14 room5 left)
   deleted: (at ball14 room5) (free left)
   added: (carry ball14 left)
   goals met: 12 of 24
34. (pick ball13 room5 right)
   deleted: (at ball13 room5) (free right)
   added: (carry ball13 right)
   goals met: 12 of 24
35. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 12 of 24
36. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 12 of 24
37. (drop ball13 rooma right)
   deleted: (carry ball13 right)
   added: (at ball13 rooma) (free right)
   goals met: 13 of 24
38. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 14 of 24
39. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 14 of 24
40. (pick ball9 room4 left)
   deleted: (at ball9 room4) (free left)
   added: (carry ball9 left)
   goals met: 14 of 24
41. (pick ball8 room4 right)
   deleted: (at ball8 room4) (free right)
   added: (carry ball8 right)
   goals met: 14 of 24
42. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 14 of 24
43. (drop ball8 rooma right)
   deleted: (carry ball8 right)
   added: (at ball8 rooma) (free right)
   goals met: 15 of 24
44. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 16 of 24
45. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 16 of 24
46. (pick ball7 room4 left)
   deleted: (at ball7 room4) (free left)
   added: (carry ball7 left)
   goals met: 16 of 24
47. (pick ball6 room4 right)
   deleted: (at ball6 room4) (free right)
   added: (carry ball6 right)
   goals met: 16 of 24
48. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 16 of 24
49. (drop ball6 rooma right)
   deleted: (carry ball6 right)
   added: (at ball6 rooma) (free right)
   goals met: 17 of 24
50. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 18 of 24
51. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 18 of 24
52. (pick ball5 room4 left)
   deleted: (at ball5 room4) (free left)
   added: (carry ball5 left)
   goals met: 18 of 24
53. (pick ball12 room4 right)
   deleted: (at ball12 room4) (free right)
   added: (carry ball12 right)
   goals met: 18 of 24
54. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 18 of 24
55. (drop ball12 rooma right)
   deleted: (carry ball12 right)
   added: (at ball12 rooma) (free right)
   goals met: 19 of 24
56. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 20 of 24
57. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 20 of 24
58. (pick ball11 room4 left)
   deleted: (at ball11 room4) (free left)
   added: (carry ball11 left)
   goals met: 20 of 24
59. (pick ball10 room4 right)
   deleted: (at ball10 room4) (free right)
   added: (carry ball10 right)
   goals met: 20 of 24
60. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 20 of 24
61. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 20 of 24
62. (drop ball10 rooma right)
   deleted: (carry ball10 right)
   added: (at ball10 rooma) (free right)
   goals met: 21 of 24
63. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 22 of 24
64. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 22 of 24
65. (pick ball4 room3 left)
   deleted: (at ball4 room3) (free left)
   added: (carry ball4 left)
   goals met: 22 of 24
66. (pick ball3 room3 right)
   deleted: (at ball3 room3) (free right)
   added: (carry ball3 right)
   goals met: 22 of 24
67. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 22 of 24
68. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 23 of 24
69. (drop ball3 rooma right)
   deleted: (carry ball3 right)
   added: (at ball3 rooma) (free right)
   goals met: 24 of 24
